### Terraform `plan` Succeeded for Workspace: `default`
<details open><summary>Show Output</summary>

```diff
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.sonarcube-aci.azurerm_mssql_server.sonarqube_mssql has been deleted
-   resource "azurerm_mssql_server" "sonarqube_mssql" {
-       id                                   = "/subscriptions/829efd7e-aa80-4c0d-9c1c-7aa2557f8e07/resourceGroups/Terraform-Sonarqube-aci-test/providers/Microsoft.Sql/servers/sonarqubemssql7043" -> null
-       name                                 = "sonarqubemssql7043" -> null
        tags                                 = {
            "Author"      = "Marcel Lupo"
            "Description" = "Sonarqube aci with caddy"
            "GitHub"      = "https://github.com/Pwd9000-ML/terraform-azurerm-sonarqube-aci"
            "Terraform"   = "True"
        }
        # (11 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.sonarcube-aci.azurerm_container_group.sonarqube_aci will be created
+   resource "azurerm_container_group" "sonarqube_aci" {
+       dns_name_label              = "sonarqube-aci-7043"
+       dns_name_label_reuse_policy = "Unsecure"
+       exposed_port                = (known after apply)
+       fqdn                        = (known after apply)
+       id                          = (known after apply)
+       ip_address                  = (known after apply)
+       ip_address_type             = "Public"
+       location                    = "uksouth"
+       name                        = "sonarqubeaci7043"
+       network_profile_id          = (known after apply)
+       os_type                     = "Linux"
+       resource_group_name         = "Terraform-Sonarqube-aci-test"
+       restart_policy              = "OnFailure"
+       tags                        = {
+           "Author"      = "Marcel Lupo"
+           "Description" = "Sonarqube aci with caddy"
+           "GitHub"      = "https://github.com/Pwd9000-ML/terraform-azurerm-sonarqube-aci"
+           "Terraform"   = "True"
        }

+       container {
+           commands                     = []
+           cpu                          = 2
+           image                        = "sonarqube:lts-community"
+           memory                       = 8
+           name                         = "sonarqube-server"
+           secure_environment_variables = (sensitive value)

+           ports {
+               port     = 9000
+               protocol = "TCP"
            }

+           volume {
+               empty_dir            = false
+               mount_path           = "/opt/sonarqube/data"
+               name                 = "data"
+               read_only            = false
+               share_name           = "data"
+               storage_account_key  = (sensitive value)
+               storage_account_name = "sonarqubesa7043"
            }
+           volume {
+               empty_dir            = false
+               mount_path           = "/opt/sonarqube/extensions"
+               name                 = "extensions"
+               read_only            = false
+               share_name           = "extensions"
+               storage_account_key  = (sensitive value)
+               storage_account_name = "sonarqubesa7043"
            }
+           volume {
+               empty_dir            = false
+               mount_path           = "/opt/sonarqube/logs"
+               name                 = "logs"
+               read_only            = false
+               share_name           = "logs"
+               storage_account_key  = (sensitive value)
+               storage_account_name = "sonarqubesa7043"
            }
+           volume {
+               empty_dir            = false
+               mount_path           = "/opt/sonarqube/conf"
+               name                 = "conf"
+               read_only            = false
+               share_name           = "conf"
+               storage_account_key  = (sensitive value)
+               storage_account_name = "sonarqubesa7043"
            }
        }
+       container {
+           commands = [
+               "caddy",
+               "reverse-proxy",
+               "--from",
+               "sonar.pwd9000.com",
+               "--to",
+               "localhost:9000",
            ]
+           cpu      = 1
+           image    = "caddy:latest"
+           memory   = 1
+           name     = "caddy-reverse-proxy"

+           ports {
+               port     = 443
+               protocol = "TCP"
            }
+           ports {
+               port     = 80
+               protocol = "TCP"
            }
        }
    }

  # module.sonarcube-aci.azurerm_mssql_database.sonarqube_mssql_db will be created
+   resource "azurerm_mssql_database" "sonarqube_mssql_db" {
+       auto_pause_delay_in_minutes         = 60
+       collation                           = "SQL_Latin1_General_CP1_CS_AS"
+       create_mode                         = "Default"
+       creation_source_database_id         = (known after apply)
+       geo_backup_enabled                  = true
+       id                                  = (known after apply)
+       ledger_enabled                      = (known after apply)
+       license_type                        = (known after apply)
+       maintenance_configuration_name      = (known after apply)
+       max_size_gb                         = 128
+       min_capacity                        = 1
+       name                                = "sonarqubemssqldb9000"
+       read_replica_count                  = (known after apply)
+       read_scale                          = false
+       restore_point_in_time               = (known after apply)
+       sample_name                         = (known after apply)
+       server_id                           = (known after apply)
+       sku_name                            = "GP_S_Gen5_2"
+       storage_account_type                = "Zone"
+       tags                                = {
+           "Author"      = "Marcel Lupo"
+           "Description" = "Sonarqube aci with caddy"
+           "GitHub"      = "https://github.com/Pwd9000-ML/terraform-azurerm-sonarqube-aci"
+           "Terraform"   = "True"
        }
+       transparent_data_encryption_enabled = true
+       zone_redundant                      = false

+       short_term_retention_policy {
+           retention_days = 7
        }
    }

  # module.sonarcube-aci.azurerm_mssql_firewall_rule.sonarqube_mssql_fw_rules[0] will be created
+   resource "azurerm_mssql_firewall_rule" "sonarqube_mssql_fw_rules" {
+       end_ip_address   = "0.0.0.0"
+       id               = (known after apply)
+       name             = "Allow All Azure IPs"
+       server_id        = (known after apply)
+       start_ip_address = "0.0.0.0"
    }

  # module.sonarcube-aci.azurerm_mssql_server.sonarqube_mssql will be created
+   resource "azurerm_mssql_server" "sonarqube_mssql" {
+       administrator_login                  = (sensitive value)
+       administrator_login_password         = (sensitive value)
+       connection_policy                    = "Default"
+       fully_qualified_domain_name          = (known after apply)
+       id                                   = (known after apply)
+       location                             = "uksouth"
+       minimum_tls_version                  = "1.2"
+       name                                 = "sonarqubemssql7043"
+       outbound_network_restriction_enabled = false
+       primary_user_assigned_identity_id    = (known after apply)
+       public_network_access_enabled        = true
+       resource_group_name                  = "Terraform-Sonarqube-aci-test"
+       restorable_dropped_database_ids      = (known after apply)
+       tags                                 = {
+           "Author"      = "Marcel Lupo"
+           "Description" = "Sonarqube aci with caddy"
+           "GitHub"      = "https://github.com/Pwd9000-ML/terraform-azurerm-sonarqube-aci"
+           "Terraform"   = "True"
        }
+       version                              = "12.0"
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```
</details>